### Pandas
#### Series

In [3]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
labels = ["a","b","c"]
my_data = [10,20,30]
arr = np.array(my_data)
d = {"a" : 10,"b" : 20,"c" : 30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(data = my_data,index = labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data = labels) #Holdanydata

0    a
1    b
2    c
dtype: object

In [12]:
pd.Series([int,float,object,print,len]) #Classesandfunctioncanbestored

0                <class 'int'>
1              <class 'float'>
2             <class 'object'>
3    <built-in function print>
4      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series([1,2,3,4],["q","w","e","r"])

In [22]:
ser2 = pd.Series([5,6,7,8],["q","w","t","r"])

In [23]:
ser1

q    1
w    2
e    3
r    4
dtype: int64

In [24]:
ser2

q    5
w    6
t    7
r    8
dtype: int64

In [25]:
ser1 + ser2 #Convertedtofloattoavoidlossofdata

e     NaN
q     6.0
r    12.0
t     NaN
w     8.0
dtype: float64

In [27]:
ser1["w"]

2

#### DataFrames

In [7]:
from numpy.random import randn #samplefromstandardnormaldistribution

In [32]:
np.random.seed(101) #Toinitializeaseedvalue

In [43]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['P','Q','R','S'])

In [44]:
df

          P         Q         R         S
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [45]:
df['P']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: P, dtype: float64

In [46]:
df['new'] = df['P'] + df['Q']

In [47]:
df

          P         Q         R         S       new
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [48]:
#rows_axis-0
#colums_axis-1

df.drop('new',axis = 1,inplace = True)

In [49]:
df

          P         Q         R         S
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [50]:
#defalutdropdeletesrow
df.drop('E')

          P         Q         R         S
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [52]:
df.shape

(5, 4)

In [56]:
#Selectingrows

df.loc['B']

P    1.025984
Q   -0.156598
R   -0.031579
S    0.649826
Name: B, dtype: float64

In [57]:
df.iloc[2]

P    2.154846
Q   -0.610259
R   -0.755325
S   -0.346419
Name: C, dtype: float64

In [58]:

df.loc[['A','B'],['P','Q','S']]

          P         Q         S
A -0.993263  0.196800  0.000366
B  1.025984 -0.156598  0.649826

In [60]:
df[df>0] #ConditionalSelection

          P         Q         R         S
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [61]:
df['P']>0

A    False
B     True
C     True
D     True
E    False
Name: P, dtype: bool

In [62]:
df1 = df[df['P']>0]

In [63]:
df1

          P         Q         R         S
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [69]:
df[df['P']>0][['Q','R']]  #Stacking

          Q         R
B -0.156598 -0.031579
C -0.610259 -0.755325
D -0.479448  0.558769

In [76]:
df[(df['P']>0) | (df['Q'] >1)]

          P         Q         R         S
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [78]:
df[(df['P']>0) & (df['Q'] <0)]

          P         Q         R         S
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [79]:
df.reset_index()

  index         P         Q         R         S
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [80]:
df.describe()

              P         Q         R         S
count  5.000000  5.000000  5.000000  5.000000
mean   0.281744  0.162672 -0.499719  0.387812
std    1.338333  1.000436  0.743748  0.550728
min   -0.993263 -0.610259 -1.136645 -0.346419
25%   -0.925874 -0.479448 -1.133817  0.000366
50%    0.147027 -0.156598 -0.755325  0.610478
75%    1.025984  0.196800 -0.031579  0.649826
max    2.154846  1.862864  0.558769  1.024810

In [81]:
new = 'X Y Z U V'.split()

In [82]:
new

['X', 'Y', 'Z', 'U', 'V']

In [84]:
df['new']=new

In [85]:
df

          P         Q         R         S new
A -0.993263  0.196800 -1.136645  0.000366   X
B  1.025984 -0.156598 -0.031579  0.649826   Y
C  2.154846 -0.610259 -0.755325 -0.346419   Z
D  0.147027 -0.479448  0.558769  1.024810   U
E -0.925874  1.862864 -1.133817  0.610478   V

In [86]:
df.set_index('new')

            P         Q         R         S
new
X   -0.993263  0.196800 -1.136645  0.000366
Y    1.025984 -0.156598 -0.031579  0.649826
Z    2.154846 -0.610259 -0.755325 -0.346419
U    0.147027 -0.479448  0.558769  1.024810
V   -0.925874  1.862864 -1.133817  0.610478

#### Multilevel Indexing

In [5]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [6]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [8]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [9]:
df

             A         B
G1 1 -1.596866  0.056186
   2  0.883309 -0.741336
   3  0.262759 -0.416300
G2 1 -2.027169  0.322676
   2 -0.448422 -0.206734
   3 -0.243020 -0.049521

In [12]:
df.loc['G1'].loc[3]

A    0.262759
B   -0.416300
Name: 3, dtype: float64

In [13]:
df.index.names = ['Groups','Num']

In [14]:
df

                   A         B
Groups Num
G1     1   -1.596866  0.056186
       2    0.883309 -0.741336
       3    0.262759 -0.416300
G2     1   -2.027169  0.322676
       2   -0.448422 -0.206734
       3   -0.243020 -0.049521

In [16]:
df.loc['G1'].loc[3]['B']

-0.4163001948764248

In [17]:
#Crosssection
df.xs('G1')

            A         B
Num
1   -1.596866  0.056186
2    0.883309 -0.741336
3    0.262759 -0.416300

In [19]:
df.xs(2,level='Num')

               A         B
Groups
G1      0.883309 -0.741336
G2     -0.448422 -0.206734

In [20]:
#Handlingmissingdata

d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)

In [21]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [23]:
df.dropna() #Removesmissingvalues

     A    B  C
0  1.0  5.0  1

In [24]:
df.dropna(axis = 1) #columnwise

   C
0  1
1  2
2  3

In [25]:
df.dropna(axis = 0) #rowwise #useinplacetoreflectonorginaldata

     A    B  C
0  1.0  5.0  1

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [27]:
df.dropna(thresh = 2) #atleast2rows

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [29]:
df.fillna('miss')

      A     B  C
0     1     5  1
1     2  miss  2
2  miss  miss  3

In [43]:
df['A'].fillna(value = df['A'].mean(),inplace = True) #Toreplacewithmean

In [44]:
df

    A    B  C
0 NaN  5.0  1
1 NaN  NaN  2
2 NaN  NaN  3

In [36]:
df.describe()

         B    C
count  1.0  3.0
mean   5.0  2.0
std    NaN  1.0
min    5.0  1.0
25%    5.0  1.5
50%    5.0  2.0
75%    5.0  2.5
max    5.0  3.0

#### Groupby

In [5]:
data = {'Company': ['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales': [200,120,340,124,243,350]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [8]:
g = df.groupby('Company')

In [9]:
g.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
g.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [11]:
g.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [14]:
g.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [15]:
g.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [16]:
g.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [17]:
g.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [18]:
g.describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

#### Operations

In [19]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2': [444,555,666,444],
                'col3':['abc','def','ghi','xyz']})

In [20]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [21]:
df.head() #Firstdataelements

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [22]:
df.tail() #Lastdataelements

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [23]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [25]:
df['col2'].nunique()

3

In [26]:
len(df['col2'].unique())

3

In [27]:
def times3(x):
    return x*3  #Customfunction

In [28]:
times3(df['col1'])

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [29]:
df['col3'].apply(len) #functiontochangethevaluescolumnwise

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [30]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [31]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [32]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [33]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [34]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [37]:
df = pd.read_csv('example.csv')

In [38]:
df.head()

,months_as_customer,age,policy_number,policy_bind_date,policy_state,policy_csl,policy_deductable,policy_annual_premium,umbrella_limit,insured_zip,...,witnesses,police_report_available,total_claim_amount,injury_claim,property_claim,vehicle_claim,auto_make,auto_model,auto_year,fraud_reported
0,328,48,521585,2014-10-17,OH,250/500,1000,1406.91,0,466132,...,2,YES,71610,6510,13020,52080,Saab,92x,2004,Y
1,228,42,342868,2006-06-27,IN,250/500,2000,1197.22,5000000,468176,...,0,?,5070,780,780,3510,Mercedes,E400,2007,Y
2,134,29,687698,2000-09-06,OH,100/300,2000,1413.14,5000000,430632,...,3,NO,34650,7700,3850,23100,Dodge,RAM,2007,N
3,256,41,227811,1990-05-25,IL,250/500,2000,1415.74,6000000,608117,...,2,NO,63400,6340,6340,50720,Chevrolet,Tahoe,2014,Y
4,228,44,367455,2014-06-06,IL,500/1000,1000,1583.91,6000000,610706,...,1,NO,6500,1300,650,4550,Accura,RSX,2009,N

In [ ]:
#Wecanuse'read_excel()'functoo

In [49]:
data = pd.read_html('https://en.wikipedia.org/wiki/Minnesota')

In [53]:
data[0].head() #0thindexwebscrapping

,Minnesota,Minnesota.1
0,State,State
1,State of Minnesota,State of Minnesota
2,FlagSeal,FlagSeal
3,"Nickname(s):Land of 10,000 Lakes;North Star S...","Nickname(s):Land of 10,000 Lakes;North Star S..."
4,Motto(s):L'toile du Nord (French: The Star o...,Motto(s):L'toile du Nord (French: The Star o...

In [54]:
from sqlalchemy import create_engine #createsqlengine

In [55]:
engine = create_engine('sqlite:///:memory:')

In [56]:
df.to_sql('sql_tabl',engine)

In [57]:
sqldf = pd.read_sql('sql_tabl',con = engine)

In [58]:
sqldf

,index,months_as_customer,age,policy_number,policy_bind_date,policy_state,policy_csl,policy_deductable,policy_annual_premium,umbrella_limit,...,witnesses,police_report_available,total_claim_amount,injury_claim,property_claim,vehicle_claim,auto_make,auto_model,auto_year,fraud_reported
0,0,328,48,521585,2014-10-17,OH,250/500,1000,1406.91,0,...,2,YES,71610,6510,13020,52080,Saab,92x,2004,Y
1,1,228,42,342868,2006-06-27,IN,250/500,2000,1197.22,5000000,...,0,?,5070,780,780,3510,Mercedes,E400,2007,Y
2,2,134,29,687698,2000-09-06,OH,100/300,2000,1413.14,5000000,...,3,NO,34650,7700,3850,23100,Dodge,RAM,2007,N
3,3,256,41,227811,1990-05-25,IL,250/500,2000,1415.74,6000000,...,2,NO,63400,6340,6340,50720,Chevrolet,Tahoe,2014,Y
4,4,228,44,367455,2014-06-06,IL,500/1000,1000,1583.91,6000000,...,1,NO,6500,1300,650,4550,Accura,RSX,2009,N
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,995,3,38,941851,1991-07-16,OH,500/1000,1000,1310.80,0,...,1,?,87200,17440,8720,61040,Honda,Accord,2006,N
996,996,285,41,186934,2014-01-05,IL,100/300,1000,1436.79,0,...,3,?,108480,18080,18080,72320,Volkswagen,Passat,2015,N
997,997,130,34,918516,2003-02-17,OH,250/500,500,1383.49,3000000,...,3,YES,67500,7500,7500,52500,Suburu,Impreza,1996,N
998,998,458,62,533940,2011-11-18,IL,500/1000,2000,1356.92,5000000,...,1,YES,46980,5220,5220,36540,Audi,A5,1998,N
999,999,456,60,556080,1996-11-11,OH,250/500,1000,766.19,0,...,3,?,5060,460,920,3680,Mercedes,E400,2007,N